PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Wed Oct 26 02:38:48 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/Projects/EmbeddedLinux/hw07")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18
      19$C$DW$2 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      20        .dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")

      67        .dwattr $C$DW$7, DW_AT_decl_line(0x40)
      68        .dwattr $C$DW$7, DW_AT_decl_column(0x1a)
      69;       optpru /tmp/02180oFW9Tg /tmp/021806DGepn 
      70;       acpiapru -@/tmp/02180qWH4cK 
      71 00000000                         .sect   ".text:main"
      72        .clink
      73        .global ||main||
      74
      75$C$DW$8 .dwtag  DW_TAG_subprogram, DW_AT_name("main")
      76        .dwattr $C$DW$8, DW_AT_low_pc(||main||)
      77        .dwattr $C$DW$8, DW_AT_high_pc(0x00)
      78        .dwattr $C$DW$8, DW_AT_TI_symbol_name("main")
      79        .dwattr $C$DW$8, DW_AT_external
      80        .dwattr $C$DW$8, DW_AT_TI_begin_file("main_pru0.c")
      81        .dwattr $C$DW$8, DW_AT_TI_begin_line(0x38)
      82        .dwattr $C$DW$8, DW_AT_TI_begin_column(0x06)
      83        .dwattr $C$DW$8, DW_AT_decl_file("main_pru0.c")
      84        .dwattr $C$DW$8, DW_AT_decl_line(0x38)
      85        .dwattr $C$DW$8, DW_AT_decl_column(0x06)
      86        .dwattr $C$DW$8, DW_AT_TI_max_frame_size(0x00)
      87        .dwpsn  file "main_pru0.c",line 56,column 17,is_stmt,address ||main||,isa 0
      88
      89        .dwfde $C$DW$CIE, ||main||
      90;----------------------------------------------------------------------
      91;  56 | void main(void) {                                                      
      92;----------------------------------------------------------------------
      93
      94;***************************************************************
      95;* FNAME: main                          FR SIZE:   0           *
      96;*                                                             *
      97;* FUNCTION ENVIRONMENT                                        *
      98;*                                                             *
      99;* FUNCTION PROPERTIES                                         *
     100;*                            0 Auto,  0 SOE     *
     101;***************************************************************
     102
     103 00000000                 ||main||:
     104;* --------------------------------------------------------------------------*
     105        .dwcfi  cfa_offset, 0
     106        .dwpsn  file "main_pru0.c",line 58,column 2,is_stmt,isa 0
     107;----------------------------------------------------------------------
     108;  58 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     109;  59 | while(1) {                                                             
     110;----------------------------------------------------------------------
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |58| CT_CFG
     112 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |58| 
     113 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |58| CT_CFG
     114;* --------------------------------------------------------------------------*
     115;*   BEGIN LOOP ||$C$L1||
     116;*
     117;*   Loop source line                : 59
     118;*   Loop closing brace source line  : 64
     119;*   Known Minimum Trip Count        : 1
     120;*   Known Maximum Trip Count        : 4294967295
     121;*   Known Max Trip Count Factor     : 1
     122;* --------------------------------------------------------------------------*
     123 0000000c                 ||$C$L1||:    
     124        .dwpsn  file "main_pru0.c",line 60,column 3,is_stmt,isa 0
     125;----------------------------------------------------------------------
     126;  60 | __R30 = (__R31&(1<<3))<<2;                                             
     127;  61 | //__delay_cycles(TIME);                                                
     128;  62 | // __R30 &= ~(1<<5);                                                   
     129;  63 | // __delay_cycles(TIME);                                               
     130;  65 | __delay_cycles(TIME);   // Give some time for press to release         
     131;  66 | // Call assembly language                                              
     132;  67 | start(TIME);                                                           
     133;  68 | __halt();                                                              
     134;----------------------------------------------------------------------
     135 0000000c 0000001108FFE0          AND       r0, r31, 0x08         ; [ALU_PRU] |60| 
     136 00000010 0000000902E0FE          LSL       r30, r0, 0x02         ; [ALU_PRU] |60| 
     137        .dwpsn  file "main_pru0.c",line 59,column 8,is_stmt,isa 0
     138 00000014 00000021000000!         JMP       ||$C$L1||             ; [ALU_PRU] |59| 
     139;* --------------------------------------------------------------------------*
     140        .dwattr $C$DW$8, DW_AT_TI_end_file("main_pru0.c")
     141        .dwattr $C$DW$8, DW_AT_TI_end_line(0x45)
     142        .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     143        .dwendentry
     144        .dwendtag $C$DW$8
     145
     146
     147;******************************************************************************
     148;* TYPE INFORMATION                                                           *
     149;******************************************************************************
     150
     151$C$DW$T$19      .dwtag  DW_TAG_structure_type
     152        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     153$C$DW$9 .dwtag  DW_TAG_member
     154        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     155        .dwattr $C$DW$9, DW_AT_name("REVID")
     156        .dwattr $C$DW$9, DW_AT_TI_symbol_name("REVID")
     157        .dwattr $C$DW$9, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     158        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     159        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     160        .dwattr $C$DW$9, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     161        .dwattr $C$DW$9, DW_AT_decl_line(0x2d)
     162        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     163        .dwendtag $C$DW$T$19
     164
     165        .dwattr $C$DW$T$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     167        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     168$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     169        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     170
     171$C$DW$T$20      .dwtag  DW_TAG_structure_type
     172        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     173$C$DW$10        .dwtag  DW_TAG_member
     174        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     175        .dwattr $C$DW$10, DW_AT_name("IDLE_MODE")
     176        .dwattr $C$DW$10, DW_AT_TI_symbol_name("IDLE_MODE")
     177        .dwattr $C$DW$10, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     178        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     179        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     180        .dwattr $C$DW$10, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     181        .dwattr $C$DW$10, DW_AT_decl_line(0x37)
     182        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     183$C$DW$11        .dwtag  DW_TAG_member
     184        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     185        .dwattr $C$DW$11, DW_AT_name("STANDBY_MODE")
     186        .dwattr $C$DW$11, DW_AT_TI_symbol_name("STANDBY_MODE")
     187        .dwattr $C$DW$11, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     188        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     189        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     190        .dwattr $C$DW$11, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     191        .dwattr $C$DW$11, DW_AT_decl_line(0x38)
     192        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     193$C$DW$12        .dwtag  DW_TAG_member
     194        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     195        .dwattr $C$DW$12, DW_AT_name("STANDBY_INIT")
     196        .dwattr $C$DW$12, DW_AT_TI_symbol_name("STANDBY_INIT")
     197        .dwattr $C$DW$12, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     198        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     199        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     200        .dwattr $C$DW$12, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     201        .dwattr $C$DW$12, DW_AT_decl_line(0x39)
     202        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     203$C$DW$13        .dwtag  DW_TAG_member
     204        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     205        .dwattr $C$DW$13, DW_AT_name("SUB_MWAIT")
     206        .dwattr $C$DW$13, DW_AT_TI_symbol_name("SUB_MWAIT")
     207        .dwattr $C$DW$13, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     208        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     209        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     210        .dwattr $C$DW$13, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     211        .dwattr $C$DW$13, DW_AT_decl_line(0x3a)
     212        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     213$C$DW$14        .dwtag  DW_TAG_member
     214        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     215        .dwattr $C$DW$14, DW_AT_name("rsvd6")
     216        .dwattr $C$DW$14, DW_AT_TI_symbol_name("rsvd6")
     217        .dwattr $C$DW$14, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     218        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     219        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     220        .dwattr $C$DW$14, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwattr $C$DW$14, DW_AT_decl_line(0x3b)
     222        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     223        .dwendtag $C$DW$T$20
     224
     225        .dwattr $C$DW$T$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     226        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     227        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     228$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     229        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     230
     231$C$DW$T$21      .dwtag  DW_TAG_structure_type
     232        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     233$C$DW$15        .dwtag  DW_TAG_member
     234        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     235        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_MODE")
     236        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     237        .dwattr $C$DW$15, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     238        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     239        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     240        .dwattr $C$DW$15, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     241        .dwattr $C$DW$15, DW_AT_decl_line(0x45)
     242        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     243$C$DW$16        .dwtag  DW_TAG_member
     244        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     245        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_CLK_MODE")
     246        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     247        .dwattr $C$DW$16, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     248        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     249        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     250        .dwattr $C$DW$16, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     251        .dwattr $C$DW$16, DW_AT_decl_line(0x46)
     252        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     253$C$DW$17        .dwtag  DW_TAG_member
     254        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     255        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_DIV0")
     256        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     257        .dwattr $C$DW$17, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     258        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     259        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     260        .dwattr $C$DW$17, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     261        .dwattr $C$DW$17, DW_AT_decl_line(0x47)
     262        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     263$C$DW$18        .dwtag  DW_TAG_member
     264        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     265        .dwattr $C$DW$18, DW_AT_name("PRU0_GPI_DIV1")
     266        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     267        .dwattr $C$DW$18, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     268        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     269        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     270        .dwattr $C$DW$18, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     271        .dwattr $C$DW$18, DW_AT_decl_line(0x48)
     272        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     273$C$DW$19        .dwtag  DW_TAG_member
     274        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     275        .dwattr $C$DW$19, DW_AT_name("PRU0_GPI_SB")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     277        .dwattr $C$DW$19, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     278        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     279        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     280        .dwattr $C$DW$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     281        .dwattr $C$DW$19, DW_AT_decl_line(0x49)
     282        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     283$C$DW$20        .dwtag  DW_TAG_member
     284        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     285        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_MODE")
     286        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     287        .dwattr $C$DW$20, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     288        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     289        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     290        .dwattr $C$DW$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     291        .dwattr $C$DW$20, DW_AT_decl_line(0x4a)
     292        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     293$C$DW$21        .dwtag  DW_TAG_member
     294        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     295        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_DIV0")
     296        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     297        .dwattr $C$DW$21, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     298        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     299        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     300        .dwattr $C$DW$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     301        .dwattr $C$DW$21, DW_AT_decl_line(0x4b)
     302        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     303$C$DW$22        .dwtag  DW_TAG_member
     304        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     305        .dwattr $C$DW$22, DW_AT_name("PRU0_GPO_DIV1")
     306        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     307        .dwattr $C$DW$22, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     308        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     310        .dwattr $C$DW$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     311        .dwattr $C$DW$22, DW_AT_decl_line(0x4c)
     312        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     313$C$DW$23        .dwtag  DW_TAG_member
     314        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     315        .dwattr $C$DW$23, DW_AT_name("PRU0_GPO_SH_SEL")
     316        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     317        .dwattr $C$DW$23, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     318        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     319        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     320        .dwattr $C$DW$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     321        .dwattr $C$DW$23, DW_AT_decl_line(0x4d)
     322        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     323$C$DW$24        .dwtag  DW_TAG_member
     324        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     325        .dwattr $C$DW$24, DW_AT_name("rsvd26")
     326        .dwattr $C$DW$24, DW_AT_TI_symbol_name("rsvd26")
     327        .dwattr $C$DW$24, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     328        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     329        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     330        .dwattr $C$DW$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwattr $C$DW$24, DW_AT_decl_line(0x4e)
     332        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     333        .dwendtag $C$DW$T$21
     334
     335        .dwattr $C$DW$T$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     336        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     337        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     338$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     339        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     340
     341$C$DW$T$22      .dwtag  DW_TAG_structure_type
     342        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     343$C$DW$25        .dwtag  DW_TAG_member
     344        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     345        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_MODE")
     346        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     347        .dwattr $C$DW$25, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     348        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     350        .dwattr $C$DW$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     351        .dwattr $C$DW$25, DW_AT_decl_line(0x58)
     352        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     353$C$DW$26        .dwtag  DW_TAG_member
     354        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     355        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_CLK_MODE")
     356        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     357        .dwattr $C$DW$26, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     358        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     359        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     360        .dwattr $C$DW$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     361        .dwattr $C$DW$26, DW_AT_decl_line(0x59)
     362        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     363$C$DW$27        .dwtag  DW_TAG_member
     364        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     365        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_DIV0")
     366        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     367        .dwattr $C$DW$27, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     368        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     370        .dwattr $C$DW$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     371        .dwattr $C$DW$27, DW_AT_decl_line(0x5a)
     372        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     373$C$DW$28        .dwtag  DW_TAG_member
     374        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     375        .dwattr $C$DW$28, DW_AT_name("PRU1_GPI_DIV1")
     376        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     377        .dwattr $C$DW$28, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     378        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     379        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     380        .dwattr $C$DW$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     381        .dwattr $C$DW$28, DW_AT_decl_line(0x5b)
     382        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     383$C$DW$29        .dwtag  DW_TAG_member
     384        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     385        .dwattr $C$DW$29, DW_AT_name("PRU1_GPI_SB")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     387        .dwattr $C$DW$29, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     388        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     390        .dwattr $C$DW$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     391        .dwattr $C$DW$29, DW_AT_decl_line(0x5c)
     392        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     393$C$DW$30        .dwtag  DW_TAG_member
     394        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     395        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_MODE")
     396        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     397        .dwattr $C$DW$30, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     398        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     399        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     400        .dwattr $C$DW$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     401        .dwattr $C$DW$30, DW_AT_decl_line(0x5d)
     402        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     403$C$DW$31        .dwtag  DW_TAG_member
     404        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     405        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_DIV0")
     406        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     407        .dwattr $C$DW$31, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     408        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     410        .dwattr $C$DW$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     411        .dwattr $C$DW$31, DW_AT_decl_line(0x5e)
     412        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     413$C$DW$32        .dwtag  DW_TAG_member
     414        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     415        .dwattr $C$DW$32, DW_AT_name("PRU1_GPO_DIV1")
     416        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     417        .dwattr $C$DW$32, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     418        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     419        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     420        .dwattr $C$DW$32, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     421        .dwattr $C$DW$32, DW_AT_decl_line(0x5f)
     422        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     423$C$DW$33        .dwtag  DW_TAG_member
     424        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     425        .dwattr $C$DW$33, DW_AT_name("PRU1_GPO_SH_SEL")
     426        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     427        .dwattr $C$DW$33, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     428        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     430        .dwattr $C$DW$33, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     431        .dwattr $C$DW$33, DW_AT_decl_line(0x60)
     432        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     433$C$DW$34        .dwtag  DW_TAG_member
     434        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     435        .dwattr $C$DW$34, DW_AT_name("rsvd26")
     436        .dwattr $C$DW$34, DW_AT_TI_symbol_name("rsvd26")
     437        .dwattr $C$DW$34, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     438        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     440        .dwattr $C$DW$34, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwattr $C$DW$34, DW_AT_decl_line(0x61)
     442        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     443        .dwendtag $C$DW$T$22
     444
     445        .dwattr $C$DW$T$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     446        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     447        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     448$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     449        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     450
     451$C$DW$T$23      .dwtag  DW_TAG_structure_type
     452        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     453$C$DW$35        .dwtag  DW_TAG_member
     454        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     455        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_STOP_REQ")
     456        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     457        .dwattr $C$DW$35, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     458        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     460        .dwattr $C$DW$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     461        .dwattr $C$DW$35, DW_AT_decl_line(0x6b)
     462        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     463$C$DW$36        .dwtag  DW_TAG_member
     464        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     465        .dwattr $C$DW$36, DW_AT_name("PRU0_CLK_STOP_ACK")
     466        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     467        .dwattr $C$DW$36, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     468        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     470        .dwattr $C$DW$36, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     471        .dwattr $C$DW$36, DW_AT_decl_line(0x6c)
     472        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     473$C$DW$37        .dwtag  DW_TAG_member
     474        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     475        .dwattr $C$DW$37, DW_AT_name("PRU0_CLK_EN")
     476        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     477        .dwattr $C$DW$37, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     478        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     480        .dwattr $C$DW$37, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     481        .dwattr $C$DW$37, DW_AT_decl_line(0x6d)
     482        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     483$C$DW$38        .dwtag  DW_TAG_member
     484        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     485        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_STOP_REQ")
     486        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     487        .dwattr $C$DW$38, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     488        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     490        .dwattr $C$DW$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     491        .dwattr $C$DW$38, DW_AT_decl_line(0x6e)
     492        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     493$C$DW$39        .dwtag  DW_TAG_member
     494        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     495        .dwattr $C$DW$39, DW_AT_name("PRU1_CLK_STOP_ACK")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     497        .dwattr $C$DW$39, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     498        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     500        .dwattr $C$DW$39, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     501        .dwattr $C$DW$39, DW_AT_decl_line(0x6f)
     502        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     503$C$DW$40        .dwtag  DW_TAG_member
     504        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     505        .dwattr $C$DW$40, DW_AT_name("PRU1_CLK_EN")
     506        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     507        .dwattr $C$DW$40, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     508        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     509        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     510        .dwattr $C$DW$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     511        .dwattr $C$DW$40, DW_AT_decl_line(0x70)
     512        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     513$C$DW$41        .dwtag  DW_TAG_member
     514        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     515        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_STOP_REQ")
     516        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     517        .dwattr $C$DW$41, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     518        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     520        .dwattr $C$DW$41, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     521        .dwattr $C$DW$41, DW_AT_decl_line(0x71)
     522        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     523$C$DW$42        .dwtag  DW_TAG_member
     524        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     525        .dwattr $C$DW$42, DW_AT_name("INTC_CLK_STOP_ACK")
     526        .dwattr $C$DW$42, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     527        .dwattr $C$DW$42, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     528        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     530        .dwattr $C$DW$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     531        .dwattr $C$DW$42, DW_AT_decl_line(0x72)
     532        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     533$C$DW$43        .dwtag  DW_TAG_member
     534        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     535        .dwattr $C$DW$43, DW_AT_name("INTC_CLK_EN")
     536        .dwattr $C$DW$43, DW_AT_TI_symbol_name("INTC_CLK_EN")
     537        .dwattr $C$DW$43, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     538        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     540        .dwattr $C$DW$43, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     541        .dwattr $C$DW$43, DW_AT_decl_line(0x73)
     542        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     543$C$DW$44        .dwtag  DW_TAG_member
     544        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     545        .dwattr $C$DW$44, DW_AT_name("UART_CLK_STOP_REQ")
     546        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     547        .dwattr $C$DW$44, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     548        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     550        .dwattr $C$DW$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551        .dwattr $C$DW$44, DW_AT_decl_line(0x74)
     552        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     553$C$DW$45        .dwtag  DW_TAG_member
     554        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     555        .dwattr $C$DW$45, DW_AT_name("UART_CLK_STOP_ACK")
     556        .dwattr $C$DW$45, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     557        .dwattr $C$DW$45, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     558        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     560        .dwattr $C$DW$45, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     561        .dwattr $C$DW$45, DW_AT_decl_line(0x75)
     562        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     563$C$DW$46        .dwtag  DW_TAG_member
     564        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     565        .dwattr $C$DW$46, DW_AT_name("UART_CLK_EN")
     566        .dwattr $C$DW$46, DW_AT_TI_symbol_name("UART_CLK_EN")
     567        .dwattr $C$DW$46, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     568        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     570        .dwattr $C$DW$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     571        .dwattr $C$DW$46, DW_AT_decl_line(0x76)
     572        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     573$C$DW$47        .dwtag  DW_TAG_member
     574        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     575        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_STOP_REQ")
     576        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     577        .dwattr $C$DW$47, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     578        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     579        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     580        .dwattr $C$DW$47, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     581        .dwattr $C$DW$47, DW_AT_decl_line(0x77)
     582        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     583$C$DW$48        .dwtag  DW_TAG_member
     584        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     585        .dwattr $C$DW$48, DW_AT_name("ECAP_CLK_STOP_ACK")
     586        .dwattr $C$DW$48, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     587        .dwattr $C$DW$48, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     588        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     590        .dwattr $C$DW$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     591        .dwattr $C$DW$48, DW_AT_decl_line(0x78)
     592        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     593$C$DW$49        .dwtag  DW_TAG_member
     594        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     595        .dwattr $C$DW$49, DW_AT_name("ECAP_CLK_EN")
     596        .dwattr $C$DW$49, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     597        .dwattr $C$DW$49, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     598        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     600        .dwattr $C$DW$49, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     601        .dwattr $C$DW$49, DW_AT_decl_line(0x79)
     602        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     603$C$DW$50        .dwtag  DW_TAG_member
     604        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     605        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_STOP_REQ")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     607        .dwattr $C$DW$50, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     608        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     610        .dwattr $C$DW$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     611        .dwattr $C$DW$50, DW_AT_decl_line(0x7a)
     612        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     613$C$DW$51        .dwtag  DW_TAG_member
     614        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     615        .dwattr $C$DW$51, DW_AT_name("IEP_CLK_STOP_ACK")
     616        .dwattr $C$DW$51, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     617        .dwattr $C$DW$51, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     618        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     620        .dwattr $C$DW$51, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     621        .dwattr $C$DW$51, DW_AT_decl_line(0x7b)
     622        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     623$C$DW$52        .dwtag  DW_TAG_member
     624        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     625        .dwattr $C$DW$52, DW_AT_name("IEP_CLK_EN")
     626        .dwattr $C$DW$52, DW_AT_TI_symbol_name("IEP_CLK_EN")
     627        .dwattr $C$DW$52, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     628        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     630        .dwattr $C$DW$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     631        .dwattr $C$DW$52, DW_AT_decl_line(0x7c)
     632        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     633$C$DW$53        .dwtag  DW_TAG_member
     634        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     635        .dwattr $C$DW$53, DW_AT_name("rsvd18")
     636        .dwattr $C$DW$53, DW_AT_TI_symbol_name("rsvd18")
     637        .dwattr $C$DW$53, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     638        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     640        .dwattr $C$DW$53, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     641        .dwattr $C$DW$53, DW_AT_decl_line(0x7d)
     642        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     643        .dwendtag $C$DW$T$23
     644
     645        .dwattr $C$DW$T$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     646        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     647        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     648$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     649        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     650
     651$C$DW$T$24      .dwtag  DW_TAG_structure_type
     652        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     653$C$DW$54        .dwtag  DW_TAG_member
     654        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     655        .dwattr $C$DW$54, DW_AT_name("PRU0_IMEM_PE_RAW")
     656        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     657        .dwattr $C$DW$54, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     658        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     660        .dwattr $C$DW$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661        .dwattr $C$DW$54, DW_AT_decl_line(0x87)
     662        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     663$C$DW$55        .dwtag  DW_TAG_member
     664        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     665        .dwattr $C$DW$55, DW_AT_name("PRU0_DMEM_PE_RAW")
     666        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     667        .dwattr $C$DW$55, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     668        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     670        .dwattr $C$DW$55, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     671        .dwattr $C$DW$55, DW_AT_decl_line(0x88)
     672        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     673$C$DW$56        .dwtag  DW_TAG_member
     674        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     675        .dwattr $C$DW$56, DW_AT_name("PRU1_IMEM_PE_RAW")
     676        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     677        .dwattr $C$DW$56, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     678        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     680        .dwattr $C$DW$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     681        .dwattr $C$DW$56, DW_AT_decl_line(0x89)
     682        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     683$C$DW$57        .dwtag  DW_TAG_member
     684        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     685        .dwattr $C$DW$57, DW_AT_name("PRU1_DMEM_PE_RAW")
     686        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     687        .dwattr $C$DW$57, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     688        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     689        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     690        .dwattr $C$DW$57, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     691        .dwattr $C$DW$57, DW_AT_decl_line(0x8a)
     692        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     693$C$DW$58        .dwtag  DW_TAG_member
     694        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     695        .dwattr $C$DW$58, DW_AT_name("RAM_PE_RAW")
     696        .dwattr $C$DW$58, DW_AT_TI_symbol_name("RAM_PE_RAW")
     697        .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     698        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     700        .dwattr $C$DW$58, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     701        .dwattr $C$DW$58, DW_AT_decl_line(0x8b)
     702        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     703$C$DW$59        .dwtag  DW_TAG_member
     704        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     705        .dwattr $C$DW$59, DW_AT_name("rsvd20")
     706        .dwattr $C$DW$59, DW_AT_TI_symbol_name("rsvd20")
     707        .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     708        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     710        .dwattr $C$DW$59, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     711        .dwattr $C$DW$59, DW_AT_decl_line(0x8c)
     712        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     713        .dwendtag $C$DW$T$24
     714
     715        .dwattr $C$DW$T$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     717        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     718$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     719        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     720
     721$C$DW$T$25      .dwtag  DW_TAG_structure_type
     722        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     723$C$DW$60        .dwtag  DW_TAG_member
     724        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     725        .dwattr $C$DW$60, DW_AT_name("PRU0_IMEM_PE")
     726        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     727        .dwattr $C$DW$60, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     728        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     730        .dwattr $C$DW$60, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     731        .dwattr $C$DW$60, DW_AT_decl_line(0x96)
     732        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     733$C$DW$61        .dwtag  DW_TAG_member
     734        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     735        .dwattr $C$DW$61, DW_AT_name("PRU0_DMEM_PE")
     736        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     737        .dwattr $C$DW$61, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     738        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     740        .dwattr $C$DW$61, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     741        .dwattr $C$DW$61, DW_AT_decl_line(0x97)
     742        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     743$C$DW$62        .dwtag  DW_TAG_member
     744        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     745        .dwattr $C$DW$62, DW_AT_name("PRU1_IMEM_PE")
     746        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     747        .dwattr $C$DW$62, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     748        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     750        .dwattr $C$DW$62, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     751        .dwattr $C$DW$62, DW_AT_decl_line(0x98)
     752        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     753$C$DW$63        .dwtag  DW_TAG_member
     754        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     755        .dwattr $C$DW$63, DW_AT_name("PRU1_DMEM_PE")
     756        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     757        .dwattr $C$DW$63, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     758        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     760        .dwattr $C$DW$63, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     761        .dwattr $C$DW$63, DW_AT_decl_line(0x99)
     762        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     763$C$DW$64        .dwtag  DW_TAG_member
     764        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     765        .dwattr $C$DW$64, DW_AT_name("RAM_PE")
     766        .dwattr $C$DW$64, DW_AT_TI_symbol_name("RAM_PE")
     767        .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     768        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     770        .dwattr $C$DW$64, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771        .dwattr $C$DW$64, DW_AT_decl_line(0x9a)
     772        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     773$C$DW$65        .dwtag  DW_TAG_member
     774        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     775        .dwattr $C$DW$65, DW_AT_name("rsvd20")
     776        .dwattr $C$DW$65, DW_AT_TI_symbol_name("rsvd20")
     777        .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     778        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     780        .dwattr $C$DW$65, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     781        .dwattr $C$DW$65, DW_AT_decl_line(0x9b)
     782        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     783        .dwendtag $C$DW$T$25
     784
     785        .dwattr $C$DW$T$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     786        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     787        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     788$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     789        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     790
     791$C$DW$T$26      .dwtag  DW_TAG_structure_type
     792        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     793$C$DW$66        .dwtag  DW_TAG_member
     794        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     795        .dwattr $C$DW$66, DW_AT_name("PRU0_IMEM_PE_SET")
     796        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     797        .dwattr $C$DW$66, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     798        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     800        .dwattr $C$DW$66, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     801        .dwattr $C$DW$66, DW_AT_decl_line(0xa4)
     802        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     803$C$DW$67        .dwtag  DW_TAG_member
     804        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     805        .dwattr $C$DW$67, DW_AT_name("PRU0_DMEM_PE_SET")
     806        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     807        .dwattr $C$DW$67, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     808        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     810        .dwattr $C$DW$67, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     811        .dwattr $C$DW$67, DW_AT_decl_line(0xa5)
     812        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     813$C$DW$68        .dwtag  DW_TAG_member
     814        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     815        .dwattr $C$DW$68, DW_AT_name("PRU1_IMEM_PE_SET")
     816        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     817        .dwattr $C$DW$68, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     818        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     819        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     820        .dwattr $C$DW$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     821        .dwattr $C$DW$68, DW_AT_decl_line(0xa6)
     822        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     823$C$DW$69        .dwtag  DW_TAG_member
     824        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     825        .dwattr $C$DW$69, DW_AT_name("PRU1_DMEM_PE_SET")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     827        .dwattr $C$DW$69, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     828        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     830        .dwattr $C$DW$69, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     831        .dwattr $C$DW$69, DW_AT_decl_line(0xa7)
     832        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     833$C$DW$70        .dwtag  DW_TAG_member
     834        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     835        .dwattr $C$DW$70, DW_AT_name("RAM_PE_SET")
     836        .dwattr $C$DW$70, DW_AT_TI_symbol_name("RAM_PE_SET")
     837        .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     838        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     840        .dwattr $C$DW$70, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     841        .dwattr $C$DW$70, DW_AT_decl_line(0xa8)
     842        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     843$C$DW$71        .dwtag  DW_TAG_member
     844        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     845        .dwattr $C$DW$71, DW_AT_name("rsvd20")
     846        .dwattr $C$DW$71, DW_AT_TI_symbol_name("rsvd20")
     847        .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     848        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     850        .dwattr $C$DW$71, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     851        .dwattr $C$DW$71, DW_AT_decl_line(0xa9)
     852        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     853        .dwendtag $C$DW$T$26
     854
     855        .dwattr $C$DW$T$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     856        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     857        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     858$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     859        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
     860
     861$C$DW$T$27      .dwtag  DW_TAG_structure_type
     862        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     863$C$DW$72        .dwtag  DW_TAG_member
     864        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     865        .dwattr $C$DW$72, DW_AT_name("PRU0_IMEM_PE_CLR")
     866        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     867        .dwattr $C$DW$72, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     868        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     870        .dwattr $C$DW$72, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     871        .dwattr $C$DW$72, DW_AT_decl_line(0xb3)
     872        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     873$C$DW$73        .dwtag  DW_TAG_member
     874        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     875        .dwattr $C$DW$73, DW_AT_name("PRU0_DMEM_PE_CLR")
     876        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     877        .dwattr $C$DW$73, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     878        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     880        .dwattr $C$DW$73, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881        .dwattr $C$DW$73, DW_AT_decl_line(0xb4)
     882        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     883$C$DW$74        .dwtag  DW_TAG_member
     884        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     885        .dwattr $C$DW$74, DW_AT_name("PRU1_IMEM_PE_CLR")
     886        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     887        .dwattr $C$DW$74, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     888        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     890        .dwattr $C$DW$74, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     891        .dwattr $C$DW$74, DW_AT_decl_line(0xb5)
     892        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     893$C$DW$75        .dwtag  DW_TAG_member
     894        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     895        .dwattr $C$DW$75, DW_AT_name("PRU1_DMEM_PE_CLR")
     896        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     897        .dwattr $C$DW$75, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     898        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     900        .dwattr $C$DW$75, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     901        .dwattr $C$DW$75, DW_AT_decl_line(0xb6)
     902        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     903$C$DW$76        .dwtag  DW_TAG_member
     904        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     905        .dwattr $C$DW$76, DW_AT_name("rsvd16")
     906        .dwattr $C$DW$76, DW_AT_TI_symbol_name("rsvd16")
     907        .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     908        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     910        .dwattr $C$DW$76, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     911        .dwattr $C$DW$76, DW_AT_decl_line(0xb7)
     912        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     913        .dwendtag $C$DW$T$27
     914
     915        .dwattr $C$DW$T$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     916        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     917        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     918$C$DW$T$53      .dwtag  DW_TAG_volatile_type
     919        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     920
     921$C$DW$T$28      .dwtag  DW_TAG_structure_type
     922        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     923$C$DW$77        .dwtag  DW_TAG_member
     924        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     925        .dwattr $C$DW$77, DW_AT_name("PMAO_PRU0")
     926        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PMAO_PRU0")
     927        .dwattr $C$DW$77, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     928        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     930        .dwattr $C$DW$77, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     931        .dwattr $C$DW$77, DW_AT_decl_line(0xc4)
     932        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     933$C$DW$78        .dwtag  DW_TAG_member
     934        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     935        .dwattr $C$DW$78, DW_AT_name("PMAO_PRU1")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PMAO_PRU1")
     937        .dwattr $C$DW$78, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     938        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     940        .dwattr $C$DW$78, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     941        .dwattr $C$DW$78, DW_AT_decl_line(0xc5)
     942        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     943$C$DW$79        .dwtag  DW_TAG_member
     944        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     945        .dwattr $C$DW$79, DW_AT_name("rsvd2")
     946        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd2")
     947        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     948        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     950        .dwattr $C$DW$79, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     951        .dwattr $C$DW$79, DW_AT_decl_line(0xc6)
     952        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     953        .dwendtag $C$DW$T$28
     954
     955        .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     956        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     957        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     958$C$DW$T$55      .dwtag  DW_TAG_volatile_type
     959        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
     960
     961$C$DW$T$29      .dwtag  DW_TAG_structure_type
     962        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     963$C$DW$80        .dwtag  DW_TAG_member
     964        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
     965        .dwattr $C$DW$80, DW_AT_name("OCP_EN")
     966        .dwattr $C$DW$80, DW_AT_TI_symbol_name("OCP_EN")
     967        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     968        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     970        .dwattr $C$DW$80, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     971        .dwattr $C$DW$80, DW_AT_decl_line(0xd3)
     972        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
     973$C$DW$81        .dwtag  DW_TAG_member
     974        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
     975        .dwattr $C$DW$81, DW_AT_name("rsvd1")
     976        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd1")
     977        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     978        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     980        .dwattr $C$DW$81, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     981        .dwattr $C$DW$81, DW_AT_decl_line(0xd4)
     982        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
     983        .dwendtag $C$DW$T$29
     984
     985        .dwattr $C$DW$T$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     986        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
     987        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
     988$C$DW$T$57      .dwtag  DW_TAG_volatile_type
     989        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
     990
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991$C$DW$T$30      .dwtag  DW_TAG_structure_type
     992        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     993$C$DW$82        .dwtag  DW_TAG_member
     994        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
     995        .dwattr $C$DW$82, DW_AT_name("PRU1_PAD_HP_EN")
     996        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
     997        .dwattr $C$DW$82, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     998        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1000        .dwattr $C$DW$82, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1001        .dwattr $C$DW$82, DW_AT_decl_line(0xde)
    1002        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1003$C$DW$83        .dwtag  DW_TAG_member
    1004        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1005        .dwattr $C$DW$83, DW_AT_name("XFR_SHIFT_EN")
    1006        .dwattr $C$DW$83, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1007        .dwattr $C$DW$83, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1008        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1010        .dwattr $C$DW$83, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1011        .dwattr $C$DW$83, DW_AT_decl_line(0xdf)
    1012        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1013$C$DW$84        .dwtag  DW_TAG_member
    1014        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1015        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1016        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1017        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1018        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1020        .dwattr $C$DW$84, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1021        .dwattr $C$DW$84, DW_AT_decl_line(0xe0)
    1022        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1023        .dwendtag $C$DW$T$30
    1024
    1025        .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1026        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1027        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1028$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1029        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1030
    1031$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1032        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1033$C$DW$85        .dwtag  DW_TAG_member
    1034        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1035        .dwattr $C$DW$85, DW_AT_name("PIN_MUX_SEL")
    1036        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1037        .dwattr $C$DW$85, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1038        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1040        .dwattr $C$DW$85, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1041        .dwattr $C$DW$85, DW_AT_decl_line(0xec)
    1042        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1043$C$DW$86        .dwtag  DW_TAG_member
    1044        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1045        .dwattr $C$DW$86, DW_AT_name("rsvd2")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd2")
    1047        .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1048        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1050        .dwattr $C$DW$86, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1051        .dwattr $C$DW$86, DW_AT_decl_line(0xed)
    1052        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1053        .dwendtag $C$DW$T$31
    1054
    1055        .dwattr $C$DW$T$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1056        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1057        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1058$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1059        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1060
    1061$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1062        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1063$C$DW$87        .dwtag  DW_TAG_member
    1064        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$38)
    1065        .dwattr $C$DW$87, DW_AT_name("$P$T0")
    1066        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T0")
    1067        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1069        .dwattr $C$DW$87, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1070        .dwattr $C$DW$87, DW_AT_decl_line(0x29)
    1071        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1072$C$DW$88        .dwtag  DW_TAG_member
    1073        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$40)
    1074        .dwattr $C$DW$88, DW_AT_name("$P$T1")
    1075        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T1")
    1076        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1077        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1078        .dwattr $C$DW$88, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1079        .dwattr $C$DW$88, DW_AT_decl_line(0x33)
    1080        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1081$C$DW$89        .dwtag  DW_TAG_member
    1082        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$42)
    1083        .dwattr $C$DW$89, DW_AT_name("$P$T2")
    1084        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T2")
    1085        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1086        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1087        .dwattr $C$DW$89, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1088        .dwattr $C$DW$89, DW_AT_decl_line(0x41)
    1089        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1090$C$DW$90        .dwtag  DW_TAG_member
    1091        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$44)
    1092        .dwattr $C$DW$90, DW_AT_name("$P$T3")
    1093        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T3")
    1094        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1095        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1096        .dwattr $C$DW$90, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1097        .dwattr $C$DW$90, DW_AT_decl_line(0x54)
    1098        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1099$C$DW$91        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$46)
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$91, DW_AT_name("$P$T4")
    1102        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T4")
    1103        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1104        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$91, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1106        .dwattr $C$DW$91, DW_AT_decl_line(0x67)
    1107        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1108$C$DW$92        .dwtag  DW_TAG_member
    1109        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$48)
    1110        .dwattr $C$DW$92, DW_AT_name("$P$T5")
    1111        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T5")
    1112        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1113        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1114        .dwattr $C$DW$92, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1115        .dwattr $C$DW$92, DW_AT_decl_line(0x83)
    1116        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1117$C$DW$93        .dwtag  DW_TAG_member
    1118        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$50)
    1119        .dwattr $C$DW$93, DW_AT_name("$P$T6")
    1120        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T6")
    1121        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1122        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1123        .dwattr $C$DW$93, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1124        .dwattr $C$DW$93, DW_AT_decl_line(0x92)
    1125        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1126$C$DW$94        .dwtag  DW_TAG_member
    1127        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$52)
    1128        .dwattr $C$DW$94, DW_AT_name("$P$T7")
    1129        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T7")
    1130        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1131        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1132        .dwattr $C$DW$94, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1133        .dwattr $C$DW$94, DW_AT_decl_line(0xa0)
    1134        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1135$C$DW$95        .dwtag  DW_TAG_member
    1136        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$54)
    1137        .dwattr $C$DW$95, DW_AT_name("$P$T8")
    1138        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T8")
    1139        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1140        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1141        .dwattr $C$DW$95, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1142        .dwattr $C$DW$95, DW_AT_decl_line(0xaf)
    1143        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1144$C$DW$96        .dwtag  DW_TAG_member
    1145        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$32)
    1146        .dwattr $C$DW$96, DW_AT_name("rsvd24")
    1147        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd24")
    1148        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1149        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1150        .dwattr $C$DW$96, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1151        .dwattr $C$DW$96, DW_AT_decl_line(0xbc)
    1152        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1153$C$DW$97        .dwtag  DW_TAG_member
    1154        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$56)
    1155        .dwattr $C$DW$97, DW_AT_name("$P$T9")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T9")
    1157        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1158        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1159        .dwattr $C$DW$97, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1160        .dwattr $C$DW$97, DW_AT_decl_line(0xc0)
    1161        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1162$C$DW$98        .dwtag  DW_TAG_member
    1163        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1164        .dwattr $C$DW$98, DW_AT_name("rsvd2c")
    1165        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd2c")
    1166        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1167        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1168        .dwattr $C$DW$98, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1169        .dwattr $C$DW$98, DW_AT_decl_line(0xcb)
    1170        .dwattr $C$DW$98, DW_AT_decl_column(0x0b)
    1171$C$DW$99        .dwtag  DW_TAG_member
    1172        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$58)
    1173        .dwattr $C$DW$99, DW_AT_name("$P$T10")
    1174        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T10")
    1175        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1176        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1177        .dwattr $C$DW$99, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1178        .dwattr $C$DW$99, DW_AT_decl_line(0xcf)
    1179        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1180$C$DW$100       .dwtag  DW_TAG_member
    1181        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$60)
    1182        .dwattr $C$DW$100, DW_AT_name("$P$T11")
    1183        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T11")
    1184        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1185        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$100, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1187        .dwattr $C$DW$100, DW_AT_decl_line(0xda)
    1188        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1189$C$DW$101       .dwtag  DW_TAG_member
    1190        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1191        .dwattr $C$DW$101, DW_AT_name("rsvd38")
    1192        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd38")
    1193        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1194        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1195        .dwattr $C$DW$101, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1196        .dwattr $C$DW$101, DW_AT_decl_line(0xe5)
    1197        .dwattr $C$DW$101, DW_AT_decl_column(0x0b)
    1198$C$DW$102       .dwtag  DW_TAG_member
    1199        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$62)
    1200        .dwattr $C$DW$102, DW_AT_name("$P$T12")
    1201        .dwattr $C$DW$102, DW_AT_TI_symbol_name("$P$T12")
    1202        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1203        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1204        .dwattr $C$DW$102, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1205        .dwattr $C$DW$102, DW_AT_decl_line(0xe8)
    1206        .dwattr $C$DW$102, DW_AT_decl_column(0x02)
    1207        .dwendtag $C$DW$T$35
    1208
    1209        .dwattr $C$DW$T$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1210        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1212$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1213        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1214        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1215        .dwattr $C$DW$T$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1216        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1217        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1218$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1219        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1220
    1221$C$DW$T$38      .dwtag  DW_TAG_union_type
    1222        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1223$C$DW$103       .dwtag  DW_TAG_member
    1224        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1225        .dwattr $C$DW$103, DW_AT_name("REVID")
    1226        .dwattr $C$DW$103, DW_AT_TI_symbol_name("REVID")
    1227        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1229        .dwattr $C$DW$103, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1230        .dwattr $C$DW$103, DW_AT_decl_line(0x2a)
    1231        .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1232$C$DW$104       .dwtag  DW_TAG_member
    1233        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$37)
    1234        .dwattr $C$DW$104, DW_AT_name("REVID_bit")
    1235        .dwattr $C$DW$104, DW_AT_TI_symbol_name("REVID_bit")
    1236        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1238        .dwattr $C$DW$104, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1239        .dwattr $C$DW$104, DW_AT_decl_line(0x2e)
    1240        .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1241        .dwendtag $C$DW$T$38
    1242
    1243        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1244        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1245        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1246
    1247$C$DW$T$40      .dwtag  DW_TAG_union_type
    1248        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1249$C$DW$105       .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1251        .dwattr $C$DW$105, DW_AT_name("SYSCFG")
    1252        .dwattr $C$DW$105, DW_AT_TI_symbol_name("SYSCFG")
    1253        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1255        .dwattr $C$DW$105, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1256        .dwattr $C$DW$105, DW_AT_decl_line(0x34)
    1257        .dwattr $C$DW$105, DW_AT_decl_column(0x15)
    1258$C$DW$106       .dwtag  DW_TAG_member
    1259        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$39)
    1260        .dwattr $C$DW$106, DW_AT_name("SYSCFG_bit")
    1261        .dwattr $C$DW$106, DW_AT_TI_symbol_name("SYSCFG_bit")
    1262        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1264        .dwattr $C$DW$106, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1265        .dwattr $C$DW$106, DW_AT_decl_line(0x3c)
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266        .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1267        .dwendtag $C$DW$T$40
    1268
    1269        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1270        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1271        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1272
    1273$C$DW$T$42      .dwtag  DW_TAG_union_type
    1274        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1275$C$DW$107       .dwtag  DW_TAG_member
    1276        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1277        .dwattr $C$DW$107, DW_AT_name("GPCFG0")
    1278        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG0")
    1279        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1281        .dwattr $C$DW$107, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1282        .dwattr $C$DW$107, DW_AT_decl_line(0x42)
    1283        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1284$C$DW$108       .dwtag  DW_TAG_member
    1285        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$41)
    1286        .dwattr $C$DW$108, DW_AT_name("GPCFG0_bit")
    1287        .dwattr $C$DW$108, DW_AT_TI_symbol_name("GPCFG0_bit")
    1288        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1289        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1290        .dwattr $C$DW$108, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1291        .dwattr $C$DW$108, DW_AT_decl_line(0x4f)
    1292        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1293        .dwendtag $C$DW$T$42
    1294
    1295        .dwattr $C$DW$T$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1296        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1297        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1298
    1299$C$DW$T$44      .dwtag  DW_TAG_union_type
    1300        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1301$C$DW$109       .dwtag  DW_TAG_member
    1302        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1303        .dwattr $C$DW$109, DW_AT_name("GPCFG1")
    1304        .dwattr $C$DW$109, DW_AT_TI_symbol_name("GPCFG1")
    1305        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1307        .dwattr $C$DW$109, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1308        .dwattr $C$DW$109, DW_AT_decl_line(0x55)
    1309        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1310$C$DW$110       .dwtag  DW_TAG_member
    1311        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$43)
    1312        .dwattr $C$DW$110, DW_AT_name("GPCFG1_bit")
    1313        .dwattr $C$DW$110, DW_AT_TI_symbol_name("GPCFG1_bit")
    1314        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1316        .dwattr $C$DW$110, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1317        .dwattr $C$DW$110, DW_AT_decl_line(0x62)
    1318        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1319        .dwendtag $C$DW$T$44
    1320
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321        .dwattr $C$DW$T$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1322        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1323        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1324
    1325$C$DW$T$46      .dwtag  DW_TAG_union_type
    1326        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1327$C$DW$111       .dwtag  DW_TAG_member
    1328        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1329        .dwattr $C$DW$111, DW_AT_name("CGR")
    1330        .dwattr $C$DW$111, DW_AT_TI_symbol_name("CGR")
    1331        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$111, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1334        .dwattr $C$DW$111, DW_AT_decl_line(0x68)
    1335        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1336$C$DW$112       .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$45)
    1338        .dwattr $C$DW$112, DW_AT_name("CGR_bit")
    1339        .dwattr $C$DW$112, DW_AT_TI_symbol_name("CGR_bit")
    1340        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1342        .dwattr $C$DW$112, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1343        .dwattr $C$DW$112, DW_AT_decl_line(0x7e)
    1344        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1345        .dwendtag $C$DW$T$46
    1346
    1347        .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1348        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1349        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1350
    1351$C$DW$T$48      .dwtag  DW_TAG_union_type
    1352        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1353$C$DW$113       .dwtag  DW_TAG_member
    1354        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1355        .dwattr $C$DW$113, DW_AT_name("ISRP")
    1356        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISRP")
    1357        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1359        .dwattr $C$DW$113, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1360        .dwattr $C$DW$113, DW_AT_decl_line(0x84)
    1361        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1362$C$DW$114       .dwtag  DW_TAG_member
    1363        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$47)
    1364        .dwattr $C$DW$114, DW_AT_name("ISRP_bit")
    1365        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ISRP_bit")
    1366        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1368        .dwattr $C$DW$114, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1369        .dwattr $C$DW$114, DW_AT_decl_line(0x8d)
    1370        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1371        .dwendtag $C$DW$T$48
    1372
    1373        .dwattr $C$DW$T$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1374        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1375        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376
    1377$C$DW$T$50      .dwtag  DW_TAG_union_type
    1378        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1379$C$DW$115       .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1381        .dwattr $C$DW$115, DW_AT_name("ISP")
    1382        .dwattr $C$DW$115, DW_AT_TI_symbol_name("ISP")
    1383        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1385        .dwattr $C$DW$115, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1386        .dwattr $C$DW$115, DW_AT_decl_line(0x93)
    1387        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1388$C$DW$116       .dwtag  DW_TAG_member
    1389        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$49)
    1390        .dwattr $C$DW$116, DW_AT_name("ISP_bit")
    1391        .dwattr $C$DW$116, DW_AT_TI_symbol_name("ISP_bit")
    1392        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1394        .dwattr $C$DW$116, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1395        .dwattr $C$DW$116, DW_AT_decl_line(0x9c)
    1396        .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    1397        .dwendtag $C$DW$T$50
    1398
    1399        .dwattr $C$DW$T$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1400        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1401        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1402
    1403$C$DW$T$52      .dwtag  DW_TAG_union_type
    1404        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1405$C$DW$117       .dwtag  DW_TAG_member
    1406        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$36)
    1407        .dwattr $C$DW$117, DW_AT_name("IESP")
    1408        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IESP")
    1409        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1411        .dwattr $C$DW$117, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1412        .dwattr $C$DW$117, DW_AT_decl_line(0xa1)
    1413        .dwattr $C$DW$117, DW_AT_decl_column(0x15)
    1414$C$DW$118       .dwtag  DW_TAG_member
    1415        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$51)
    1416        .dwattr $C$DW$118, DW_AT_name("IESP_bit")
    1417        .dwattr $C$DW$118, DW_AT_TI_symbol_name("IESP_bit")
    1418        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1420        .dwattr $C$DW$118, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1421        .dwattr $C$DW$118, DW_AT_decl_line(0xaa)
    1422        .dwattr $C$DW$118, DW_AT_decl_column(0x05)
    1423        .dwendtag $C$DW$T$52
    1424
    1425        .dwattr $C$DW$T$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1426        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1427        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1428
    1429$C$DW$T$54      .dwtag  DW_TAG_union_type
    1430        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431$C$DW$119       .dwtag  DW_TAG_member
    1432        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    1433        .dwattr $C$DW$119, DW_AT_name("IECP")
    1434        .dwattr $C$DW$119, DW_AT_TI_symbol_name("IECP")
    1435        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1437        .dwattr $C$DW$119, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1438        .dwattr $C$DW$119, DW_AT_decl_line(0xb0)
    1439        .dwattr $C$DW$119, DW_AT_decl_column(0x15)
    1440$C$DW$120       .dwtag  DW_TAG_member
    1441        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$53)
    1442        .dwattr $C$DW$120, DW_AT_name("IECP_bit")
    1443        .dwattr $C$DW$120, DW_AT_TI_symbol_name("IECP_bit")
    1444        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1446        .dwattr $C$DW$120, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1447        .dwattr $C$DW$120, DW_AT_decl_line(0xb8)
    1448        .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    1449        .dwendtag $C$DW$T$54
    1450
    1451        .dwattr $C$DW$T$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1452        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1453        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1454
    1455$C$DW$T$56      .dwtag  DW_TAG_union_type
    1456        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1457$C$DW$121       .dwtag  DW_TAG_member
    1458        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$36)
    1459        .dwattr $C$DW$121, DW_AT_name("PMAO")
    1460        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PMAO")
    1461        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1463        .dwattr $C$DW$121, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1464        .dwattr $C$DW$121, DW_AT_decl_line(0xc1)
    1465        .dwattr $C$DW$121, DW_AT_decl_column(0x15)
    1466$C$DW$122       .dwtag  DW_TAG_member
    1467        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$55)
    1468        .dwattr $C$DW$122, DW_AT_name("PMAO_bit")
    1469        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PMAO_bit")
    1470        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1472        .dwattr $C$DW$122, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1473        .dwattr $C$DW$122, DW_AT_decl_line(0xc7)
    1474        .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    1475        .dwendtag $C$DW$T$56
    1476
    1477        .dwattr $C$DW$T$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1478        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1479        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1480
    1481$C$DW$T$58      .dwtag  DW_TAG_union_type
    1482        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1483$C$DW$123       .dwtag  DW_TAG_member
    1484        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$36)
    1485        .dwattr $C$DW$123, DW_AT_name("IEPCLK")
PRU Assembler Unix v2.1.2 Wed Oct 26 02:38:48 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   28

    1486        .dwattr $C$DW$123, DW_AT_TI_symbol_name("IEPCLK")
